Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་དཔུང་དང་བཞོན་པར་བཅས་པའི་བདུད་རབ་ཏུ་ཕམ་པར་བྱས་ཏེ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ། །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་དེ་བཞིན་གཤེགས་པ་མཚན་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཛད་དོ། །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་དེ་བཞིན་གཤེགས་པ་མཚན་འདི་དང་ནི་ཆེ་གེ་མོ་ཞིག་སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་མ་ལུས་པར་མཛད་ནས། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཛད་དོ། །ཞེས་བྱ་བའི་སྒྲ་འབྱིན་ཏེ། རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་གི་རྩྭ་དང་ཤིང་དང་། ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་ཐམས་ཅད་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཆར་བླགས་པའི་མུར་ཐུག་པར་ནི་རུང་ཡང་སྲིད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་དང་།
en: There came the words that said that in this and that particular world a bodhisattva named such and such is praying to attain enlightenment; in this and that particular world a bodhisattva named such and such is accomplishing a difficult renunciation; in this and that particular world a bodhisattva named such and such is purifying the domain of omniscient wisdom; in this and that particular world a bodhisattva named such and such is going to the bodhimaṇḍa; in this and that particular world a bodhisattva named such and such has defeated Māra, and his army is attaining the highest, complete enlightenment of buddhahood; in this and that particular world a tathāgata named such and such is turning the wheel of the Dharma; in this and that particular world a tathāgata named such and such, having accomplished all the deeds of a buddha without remainder, is passing away into the state of nirvāṇa without any remaining skandhas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པའི་ཁྱད་པར་གང་ཁོ་བོ་ཅག་གི་གནས་ན་ཡོད་པའི་ཤིང་ཏ་ལའི་ཕྲེང་བ་ལས་རོལ་མོའི་ཡོ་བྱད་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། ཁྱིམ་གྱི་ལོངས་སྤྱོད་རླུང་གིས་བསྐྱོད་པའི་སྒྲ་འབྱུང་ཞིང་། ང་རོ་འབྱིན་པ་དང་། རྣ་ལམ་དུ་གྲགས་པའི་མཐའ་ནི་ཐུག་པར་མི་རུང་ངོ་། །
en: “Noble one, it is possible that there could be an end to the number of atoms from all the plants, wood, branches, leaves, and petals in Jambudvīpa, but there is no end to the number of the names of tathāgatas, of the bodhisattva prayers, and of the different engagements in bodhisattva conduct that come from, resound from, and are heard from the rows of palm trees and so on up to the musical instruments, the precious jewelry, the enjoyed possessions in the homes, and the blowing of the breezes in our domain.

source: དེ་ལྟར་བདག་ཅག་ཀྱང་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་འཇུག་པའི་སྨོན་ལམ་དང་། སྤྱོད་པ་དང་མཚན་གྱི་ཆུ་ཀླུང་གི་སྒྲས་དགའ་བ་ཆེན་པོའི་ཤུགས་དྲག་པོས་ཉམས་བདེ་བ་སྐྱེས་ཏེ།
en: “In that way, we experienced bliss through the intense joy of hearing the sound of a river of the words Buddha, Dharma, and Saṅgha, the prayers and conduct engaged in by bodhisattvas, and their names.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེ་ལྟར་བདག་ཅག་ཕྱིན་པར་གྱུར་ནས་ཀྱང་། འཕགས་པ་འདི་ནི་བདག་ཅག་ལ་ཅི་ནས་ཀྱང་།
en: “We each went to be in the presence of the ārya.

source: ཁོ་བོ་ཅག་གི་འཁོར་གྱི་སེམས་ཅན་དུ་མ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མྱི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཆོས་སྟོན་པ་མཛད་དོ། །
en: When we arrived in his presence, this ārya taught us the Dharma so that we would become irreversible in our progress to the highest, complete enlightenment.”

source: འདོད་པ་ལ་སྤྱོད་པའི་ལྷའི་བུ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་ཁ་དོག་ཤིན་ཏུ་མཛེས་པ་དག་ཀྱང་ནམ་མཁའ་ལ་འཁོད་ཅིང་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པས་མཆོད་པ་བྱས་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །
en: Countless thousands of desire-realm devas with beautiful bodies were also in the sky, making offerings with mentally emanated offerings.

source: འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་དག་ལས་རྣམ་པ་འདི་ལྟ་བུའི་འོད་བྱུང་ཏེ།
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, a light came from these great masses of fire.

source: འོད་དེས་མར་ན་མནར་མེད་པ་ཡན་ཆད་དུ་སེམས་ཅན་དམྱལ་བ་རྣམས་སྣང་བར་བྱས་ནས། སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རྩེ་ཟིལ་བར་བྱས་ཏེ།
en: That light illuminated beings as far down as the Avīci hell and extinguished the sufferings of all the beings in the hells.

source: འོད་དེ་ཉིད་ཀྱིས་འཕགས་པ་འདི་བདག་ཅག་གི་མྱིག་ལམ་དུ་སྣང་བར་བསྟན་པས་དེའི་ཕྱིར་ཁོ་བོ་ཅག་ཀྱང་འཕགས་པ་འདི་ལ་སེམས་མོས་པར་གྱུར་ནས། འདོད་པ་ལ་སྤྱོད་པའི་ལྷའི་རིས་ཉམས་སུ་བདེ་བར་སྐྱེས་སོ། །
en: That light brought the image of this ārya to our eyes, and therefore we yearned for this ārya and experienced the bliss of the realm of desire devas.

source: དེ་ལྟར་བདག་ཅག་ཀྱང་འཕགས་པ་འདིས་མཛད་པ་ལ་དྲིན་དུ་གཟོ་ཞིང་མཐོང་བས་མི་ངོམས་པས་འདོད་པའི་དགའ་བ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ཏེ།
en: In that way, we were grateful to him, never ceased wanting to see him, and renounced delighting in desires.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེར་བདག་ཅག་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་ཅི་ནས་ཀྱང་།
en: We went to be in the presence of this ārya.

source: སེམས་ཅན་ཚད་མྱེད་པ་རྣམས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་པ་མཛད་དོ། །
en: This ārya taught us the Dharma so that we would pray for the enlightenment of limitless beings.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཆོས་ཀྱི་ཚུལ་རྣམ་པ་འདི་ལྟ་བུ་ཐོས་ནས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Then Sudhana, the head merchant’s son, on hearing this way of the Dharma, was overjoyed, pleased, happy, and content.

source: བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ལ་ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་བསྐྱེད་དེ།
en: He recognized the brahmin Jayoṣmāyatana to be a true kalyāṇamitra.

source: བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་དེ་ལྟར་བདག་གིས་དགེ་བའི་བཤེས་གཉེན་གྱི་བཀའ་དང་། འགལ་བར་བགྱིས་པའི་ནོངས་པ་ལ་ནོངས་པར་བཤགས་སོ། །
en: He bowed his head to the feet of the brahmin Jayoṣmāyatana and said, “Ārya, I confess my transgression of having disobeyed a kalyāṇamitra’s instruction.”

source: དེ་ནས་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་རྗེས་སུ་བསྟན་དང་འཐུན་བྱེད་ཅིང་། དྲན་པ་ཉེ་བར་གཞག་སྟེ་བླ་མའི་ངག་གཅོག་མི་བྱེད་ན། དེ་ཕྱིར་དེ་ཡི་དོན་རྣམས་ཐམས་ཅད་འཐུན་པར་འགྲུབ་པར་འགྱུར། །
en: Then the brahmin Jayoṣmāyatana recited this verse to Sudhana, the head merchant’s son: “The bodhisattva who successfully follows the instructions And who is mindful not to disobey the guru’s words Will successfully accomplish all goals and successfully Attain the wisdom of buddhahood, enlightened under the Bodhi tree.”

source: མཐུན་པའི་སངས་རྒྱས་ཡེ་ཤེས་བྱང་ཆུབ་དྲུང་དུ་འཚང་ཡང་རྒྱ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རིའི་གཡང་སའི་ལམ་སྤུ་གྲི་སོ་གཤིབས་པ་ལ་འཛེགས་ཏེ། མེའི་ཕུང་པོ་ཆེན་པོ་དེར་མཆོངས་སོ། །
en: Then Sudhana, the head merchant’s son, climbed the path of razors up the mountain precipice and jumped down into the great mass of fire.

source: དེ་དེ་ལྟར་མཆོངས་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: When he jumped, he attained the bodhisattva samādhi called completely stable.

source: མྱེ་དེས་རེག་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཞི་བའི་བདེ་བ་མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ནས་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: When he landed in the fire, he attained the bodhisattva samādhi called perceiving the bliss of peace. Sudhana said, “I am astonished, Ārya!

source: འཕགས་པ་མྱེའི་ཕུང་པོ་ལ་དེ་ལྟར་རེག་ན་བདེ་བ་དང་། རིའི་ལམ་སྤུ་གྲིས་གཏམས་པ་འདི་ཡང་དེ་ལྟར་རེག་ན་བདེ་བ་དེ་ནི་ངོ་མཚར་ཆེའོ། །དེས་སྨྲས་པ།
en: The touch of the fire was blissful, and the mountain path of razors was also blissful to the touch.”

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དཀྱིལ་འཁོར་ཡོངས་སུ་མི་ཟད་པ་ཐོབ་པ་སྟེ།
en: The brahmin Jayoṣmāyatana said, “Noble one, I have attained the bodhisattva liberation called the unceasing domain.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དཀྱིལ་འཁོར་ཡོངས་སུ་མི་ཟད་པ་འདི་ཤེས་པར་ཟད་ན།
en: However, noble one, I know only this bodhisattva liberation called the unceasing domain.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་མེའི་ཕུང་པོ་ལྟ་བུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་བྱ་བའི་སྨོན་ལམ་ཅན་རུ་མཚོན་ཕྱིར་མི་ལྡོག་པ་དང་ལྡན་པ། སེམས་ལ་ཐུབ་པ་མེད་ཅིང་སེམས་དམའ་བ་མེད་པ་དང་ལྡན་པ། ཡིད་ཞུམ་པ་མེད་པ་ཅན་རྡོ་རྗེའི་སྙིང་པོ་དང་ལྡན་པའི་མཐུ་བོ་ཆེ་ལྟ་བུ་བརྩམས་པ་ཆེན་པོ་མཐར་ཕྱིན་པར་བྱ་བ་ལ་སྒྱིད་ལུག་པ་མེད་པ་སྦྱོར་བ་ལྷོད་པ་མྱེད་པ། རླུང་གི་དཀྱིལ་འཁོར་ལྟ་བུར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་བརྩོན་པ། བརྩོན་འགྲུས་ཕྱིར་མི་ལྡོག་པ་དང་ལྡན་པ།
en: How could I know or describe the qualities of the bodhisattvas who are like masses of fire, who pray to eliminate all the kleśas and wrong views of all beings, who have an ensign that is never in retreat, who have invincible minds, who have minds that never despair, who have minds that are never despondent, who are like Nārāyaṇa possessing the vajra essence, who reach the conclusion of their great undertakings, who have no despondency, who never slacken, who are like whirlwinds, who are dedicated to the benefit of all beings, who have irreversible diligence, and who wear the armor of irreversibility?

source: ཕྱིར་མི་ཟློག་པའི་གོ་ཅ་བགོས་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a city called Siṃha­vijṛmbhita.

source: དེ་ན་རྒྱལ་པོ་སེང་གེ་དཔལ་གྱི་བུ་མོ་བྱམས་མ་ཞེས་བྱ་བ་བུ་མོ་ལྔ་བརྒྱའི་འཁོར་དང་བཅས་པ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: There dwells Maitrayaṇī, the daughter of King Siṃhaketu, with her entourage of five hundred maidens. Go to her and ask her, ‘How does a bodhisattva train in bodhisattva conduct?

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་ཞུགས་པ་མོས་པ་རྒྱ་ཆེན་པོས་རྣམ་པར་དག་པ་ཐེག་པ་ཆེན་པོ་ལ་མངོན་དུ་ཕྱོགས་པ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མངོན་པར་མོས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ལ་ཡང་དག་པར་ཞུགས་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བར་སྤྲོ་བ། ཆོས་ཀྱི་རིམ་གྲོ་ལ་རྣམ་པར་སྤྱོད་པ། ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་མངོན་དུ་གྱུར་པ། ཡང་དག་པའི་མཐའ་ཤིན་ཏུ་རྟོགས་པ། ཡེ་ཤེས་ཀྱི་མཐའ་ལ་གནས་པའི་ཡུལ་དང་ལྡན་པ། དུས་གསུམ་སྐད་ཅིག་གི་ཆ་ཤས་ལ་ཁོང་དུ་ཆུད་པར་བྱེད་པ། ནམ་མཁའི་མཐའ་གཉིས་སུ་མེད་པ་མངོན་དུ་གྱུར་པ། མི་གཉིས་པའི་མཐའ་རྣམ་པར་གདོན་མི་ཟ་བ་ཐོབ་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཐའ་ལ་རྣམ་པར་མི་རྟོག་པར་གནས་པ། བསྒྲིབས་པ་མེད་པའི་མཐས་གདུལ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཞུགས་པ། ཆོས་ཀྱི་མཐའ་དང་མྱི་འགལ་བར་བྱ་བ་ལ་གཞོལ་བ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the brahmin Jayoṣmāyatana, circumambulated the brahmin Jayoṣmāyatana, keeping him to his right, many hundreds of thousands of times, and, looking back again and again, departed from the presence of the brahmin Jayoṣmāyatana.

source: དེ་བཞིན་གཤེགས་པའི་མཐའ་ལ་མཐའ་མེད་པར་ཁོང་དུ་ཆུད་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཐའ་ལ་རྣམ་པར་མི་རྟོག་པར་གནས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་དྲ་བ་རྣམ་པར་གཏོར་བའི་ཡེ་ཤེས་ལ་གཞོལ་བ། ཞིང་ལ་མངོན་པར་ཆགས་པ་ཐམས་ཅད་དང་བྲལ་བ། སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་གནས་པ་མེད་པར་སྤྱོད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པའི་འདུ་ཤེས་དང་ལྡན་པ། སྒྲ་ཐམས་ཅད་ཚིག་གི་ལམ་ལྟ་བུར་ཁོང་དུ་ཆུད་པ།
en: Maitrayaṇī Chapter 13 Sudhana, the head merchant’s son, with inconceivable respect for kalyāṇamitras, with a pure, vast aspiration, intent on the Mahāyāna, aspiring to the wisdom of buddhahood, following the Buddhadharma, longing to follow the kalyāṇamitras, practicing veneration of the Dharma, intent on unimpeded wisdom, with conviction in the highest goal, being within the range of the apogee of wisdom, comprehending the three times in a fraction of an instant, intent on the nondual apogee of space, having attained certainty in the apogee of nonduality, dwelling in the nonconceptual apogee of the realm of the Dharma, having entered the comprehension of the way that is the apogee of being free of obscurations, dedicated to the harmony that is the apogee of action, realizing that the apogee of the tathāgatas is without an apogee, dwelling in the nonconceptuality that is the apogee of the buddhas, and dedicated to the wisdom that disperses the network of conceptualizations of all beings, had a mind free from all attachment to realms, free from attachment to all the circles of followers of the buddhas, and practiced, without dwelling in any location, the purification of all buddha realms; he had the recognition that there is no self and no beings within all beings, comprehended that all sounds are like echoes, and was dedicated to the realization that all forms are the same as reflections of forms.

source: གཟུགས་ཐམས་ཅད་གཟུགས་ཀྱི་གཟུགས་བརྙན་དང་མཉམ་པར་རྣམ་པར་རིག་པར་བྱ་བ་ལ་གཞོལ་བ་དེ་མཐར་གྱིས་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་གྲོང་ཁྱེར་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana eventually arrived at the city of Siṃha­vijṛmbhita.

source: བུ་མོ་བྱམས་མ་ཚོལ་ཞིང་ཡོངས་སུ་རྨེད་རྨེད་པ་ལས། རྒྱལ་པོ་སེང་གེ་དཔལ་གྱི་བུ་མོ་བྱམས་མ་འཁོར་བུ་མོ་ལྔ་བརྒྱ་དང་ལྡན་པ་དེ་ཁང་པ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བའི་ནང་ན་ཁྲི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་རྐང་པ་ཅན།
en: He searched for and sought the maiden Maitrayaṇī and heard that Maitrayaṇī, the daughter of King Siṃhaketu, with her entourage of five hundred maidens, was in a palace called Vairocana­garbha.

source: གསེར་གྱི་ལྕག་ཕོད་ཀྱི་དྲ་བས་ལེགས་པར་བླས་པ། ལྷ་རྫས་ཀྱི་སྟན་བཏིང་བ་ལ་འདུག་ཅིང་ཆོས་སྟོན་ཏོ། །ཞེས་ཐོས་ནས།
en: She was teaching the Dharma while seated on a throne that had uragasāra sandalwood legs, was draped in a network of threads of gold, and had a cushion made of divine material.

source: སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་གྲོང་ཁྱེར་དུ་སོང་སྟེ། རྒྱལ་པོ་སེང་གེ་དཔལ་གྱི་གནས་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Sudhana entered the city of Siṃha­vijṛmbhita and went to the residence of King Siṃhaketu.

source: རྒྱལ་པོའི་ཕྱི་སྒོའི་སྒོ་གང་ན་བུ་མོ་བྱམས་མ་མཐོང་བར་དགའ་བའི་ཕྱིར་སྡོད་ཅིང་འདུག་འདུག་པ་དང་།
en: He sat at the king’s outer gate hoping to see the maiden Maitrayaṇī.

source: དེས་དེར་སྲོག་ཆགས་བརྒྱ་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འདོང་བ་མཐོང་ནས།
en: Sudhana saw many hundreds of people, many thousands of people, many hundreds of thousands of people there.

source: ཁྱེད་གང་ནས་འོངས།
en: He asked them, “Where have you come from?

source: ད་གང་དུ་འདོད་ཞེས་དྲིས་པ་དང་།
en: Where are you going?”

source: དེ་དག་ན་རེ་ངེད་ནི་བུ་མོ་བྱམས་མའི་དྲུང་དུ་ཆོས་མཉན་པའི་ཕྱིར་འདོང་ངོ་ཞེས་ནས།
en: They replied, “We have come to hear the Dharma from the maiden Maitrayaṇī.”

source: དེས་བསམས་པ་འདིར་ནི་སུ་འགྲོ་ཡང་བགག་པ་མེད་པ་ལྟ་ཞིག་སྙམ་སྟེ། དེ་ཡང་ནང་དུ་ཕྱིན་ཏོ། །དེ་ལྟར་ཕྱིན་ཏེ་བལྟས་ན་ཁང་པ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ཅན་དེ་ཡང་། གཞི་ཤེལ་དུ་འདུག་པའི་ས་ལས་བླངས་ཏེ། བཻ་ཌཱུརྱའི་ཀ་བ་བཀྱེ་བ། རྩིག་པ་རྡོ་རྗེ་ལས་བྱས་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལྷུན་དང་ལྡན་པའི་བ་གམ་བརྒྱ་ཕྲག་སྟོང་གིས་བརྒྱན་པ།
en: Sudhana thought, “It seems as if everyone is allowed to go in,” and he went inside.

source: ནོར་བུ་རིན་པོ་ཆེ་གྲངས་མེད་པས་རྣམ་པར་བྲིས་པ། རིན་པོ་ཆེ་སྟོང་གི་སྙིང་པོའི་མེ་ལོང་གི་དཀྱིལ་འཁོར་གྱིས་ཤིན་ཏུ་སྤ་བར་བྱས་པ། ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བའི་ཡིད་དུ་འོང་བས་རྣམ་པར་བརྒྱན་པ། རིན་པོ་ཆེའི་ཤིང་ཐགས་གྲངས་མེད་པས་ཡོངས་སུ་བསྐོར་བ། གསེར་གྱི་དྲིལ་བུ་བརྒྱ་སྟོང་ཤིན་ཏུ་འཁྲོལ་བའི་སྒྲ་སྙན་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱན་དང་ལྡན་པ་འདུག་པར་མཐོང་ངོ་། །
en: When he had gone inside and looked around, he saw that the Vairocana­garbha palace had the inconceivable display of a floor that was made of crystal, pillars made of beryl, and walls made of diamonds; it was adorned with hundreds of thousands of pinnacles made of solid gold, was furnished with round mirrors made of the essence of a thousand precious materials, and was adorned with countless precious jewels; it was arrayed with precious jewels that delighted beings and was strewn with countless nets of jewels; and there was the melodious sound from hundreds of thousands of jingling golden bells.

source: བུ་མོ་བྱམས་མ་དེ་ཡང་མིག་དཀར་ནག་འབྱེས་པ། སྐྲ་མཐོན་ཏིང་དུ་འདུག་པ། མདོག་གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པ་མཐོང་ནས།
en: He saw the maiden Maitrayaṇī, who had deep black eyes, deep black hair, and golden skin.

source: དེས་དེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཐལ་མོ་སྦྱར་ཏེ་མདུན་དུ་འདུག་ནས།
en: Sudhana bowed his head to the feet of the maiden Maitrayaṇī, circumambulated her, keeping her to his right, many hundreds of thousands of times, and with his hands together in homage sat down before her.

source: འདི་སྐད་ཅེས་སྨྲས་སོ། འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Sudhana said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: “Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ། སྨྲས་པ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རིགས་ཀྱི་བུ། ཁོ་མོའི་གནས་ཀྱི་རྒྱན་ལ་ལྟོས་ཤིག །ཅེས་ནས་དེས་ཀུན་ཏུ་བྱུལ་ཏེ་བལྟས་པ་དང་། རྩིག་པ་རེ་རེ་དང་། ཀ་བ་རེ་རེ་དང་།
en: Maitrayaṇī said, “Noble one, look at the display of my residence!”

source: མེ་ལོང་གི་དཀྱིལ་འཁོར་རེ་རེ་དང་། རྣམ་པའི་བྱེ་བྲག་རེ་རེ་དང་། དབྱིབས་རེ་རེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་རེ་རེ་དང་། གསེར་གྱི་དྲིལ་བུ་རེ་རེ་དང་། རིན་པོ་ཆེའི་ཤིང་རེ་རེ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་དང་། རིན་པོ་ཆེའི་སེ་མོ་དོ་རེ་རེ་ལས་ཀྱང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐོག་མ་ཐུགས་བསྐྱེད་པ་དང་བཅས་པ། སྤྱོད་པ་དང་སྨོན་ལམ་གྱི་ཡུལ་དང་བཅས་པ། འབྱུང་བའི་རྒྱན་དང་བཅས་པ། མངོན་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་བཅས་པ།
en: Sudhana looked all around and saw in each wall, each pillar, each round mirror, each form, each shape, each precious jewel, each golden bell, each precious tree, each pore, and each string of jewels the images of the tathāgatas in all the realm of phenomena first developing their aspiration for enlightenment, their conduct and the scope of their prayers, the display of their setting forth, their manifestation of the attainment of buddhahood, their turning the wheel of the Dharma, and their demonstration of passing into nirvāṇa.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟོན་པ་དང་བཅས་པར་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་མཐོང་བར་གྱུར་ཏོ། །དམྱིགས་པ་དེ་དག་རེ་རེ་ལས་ཇི་ལྟ་བ་བཞིན་དུ་དམྱིགས་པ་ཐམས་ཅད་ལས་ཀྱང་མཐོང་བར་གྱུར་ཏོ། །
en: What he saw from one object of perception he saw from all the objects of perception.

source: འདི་ལྟ་སྟེ་དཔེར་ན། ཆུས་ཡོངས་སུ་གང་བའི་མཚོ་དང་ཞིང་རྙོག་པ་མེད་ལ་རྣམ་པར་གསལ་བ་ལ་ནི་ནམ་མཁའ་གཉི་ཟླ་དང་། སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ། གཟུགས་བརྙན་གྱི་ཚུལ་དུ་ཡོངས་སུ་སྣང་ངོ་། །
en: For example, there appeared in a lake filled with water that was unpolluted and clear the reflection of the sky, the sun, the moon, and the constellations of stars.

source: དེ་བཞིན་དུ་ཁང་པ་རྣམ་པར་སྣང་བའི་སྙིང་པོའི་དམྱིགས་པ་རེ་རེ་ལས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ཀུན་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་གཟུགས་བརྙན་གྱི་ཚུལ་དུ་ཡོངས་སུ་སྣང་བར་གྱུར་ཏེ། དེ་ནི་བུ་མོ་བྱམས་མའི་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུའི་ཕྱིར་ཏེ།
en: In the same way, in every object of perception within the Vairocana­garbha palace appeared the reflections of all the tathāgatas present in the entire realm of phenomena as the result of the maiden Maitrayaṇī’s previous roots of merit.

source: དེས་དེ་ལྟར་རྣམ་པར་བལྟས་ནས། སངས་རྒྱས་མཐོང་བའི་རྒྱན་གྱི་མཚན་མ་དེ་ཡོངས་སུ་བཟུང་སྟེ། ཐལ་མོ་སྦྱར་ནས། བུ་མོ་བྱམས་མའི་གདོང་དུ་བལྟས་པ་དང་།
en: When Sudhana had seen and remembered the features of this display of the vision of the buddhas, with his hands together in homage he looked at Maitrayaṇī’s face.

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོའི་རྒྱུད་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཐོབ་པ་སྟེ།
en: She said to him, “Noble one, I have attained the teaching of the gateway to the perfection of wisdom called the complete display.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོའི་རྒྱུད་འདི་ནི་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱའི་ཀླུང་སུམ་ཅུ་རྩ་དྲུག་གི་བྱེ་མ་སྙེད་ལས་ཡོངས་སུ་བཙལ་བ་སྟེ།
en: I sought this teaching of the gateway to the perfection of wisdom called the complete display from as many tathāgatas as there are grains of sand in three hundred and sixty million Ganges Rivers.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོའི་རྒྱུད་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་འདི་སྒོ་སྣ་ཚོགས་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱ་བས་རྟོགས་པར་མཛད་དེ།
en: Those tathāgatas, through making me enter various gateways, made me realize the teaching of the gateway to the perfection of wisdom called the complete display.

source: གཅིག་གིས་གང་གསུངས་པ་དེ་འང་གཉིས་ཀྱིས་མ་གསུངས་སོ། །སྨྲས་པ།
en: What was taught by any one of them was not taught by another of them.”

source: འཕགས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོའི་རྒྱུད་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་འདིའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས། སྨྲས་པ།
en: Sudhana asked, “Āryā, what is the scope of this teaching of the gateway to the perfection of wisdom called the complete display?”

source: རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོའི་རྒྱུད་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་འདི་ལ་ཁོ་མོ་མངོན་དུ་བྱེད་ཅིང་། སེམས་པ་དང་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། རྣམ་པར་དཔྱོད་པ་དང་། རྗེས་སུ་སེམས་པ་དང་། དྲན་པར་བྱ་བ་དང་། ཡོངས་སུ་གཟུང་པ་དང་། རྣམ་པར་བརྟག་པ་དང་། མངོན་པར་བསྒྲུབ་པ་དང་། ཡང་དག་པར་བརྒྱན་པར་བྱ་བ་དང་། རབ་ཏུ་རྣམ་པར་དབྱེ་བ་བྱེད་པའི་ཚེ། གཟུངས་ཀུན་ནས་སྒོ་ཞེས་བྱ་བ་ཡོངས་སུ་སྐྱེ་སྟེ།
en: Maitrayaṇī answered, “Noble one, having been made to face, reflect on, follow, practice, contemplate, approach, grasp, display, attain, adorn, and analyze this teaching of the gateway to the perfection of wisdom called the complete display, there arose the power of retention called the complete gateways.
